
## Plan Result (terraform/cloudflare/b0xp.io/k8s)

[CI link](https://github.com/boxp/arch/actions/runs/12226497190)


<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.k8s
  * cloudflare_zero_trust_access_application.k8s
  * cloudflare_zero_trust_access_policy.github_actions_access
  * cloudflare_zero_trust_tunnel_cloudflared.k8s_tunnel
  * cloudflare_zero_trust_tunnel_cloudflared_config.k8s_tunnel
  * random_password.tunnel_secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.k8s will be created
  + resource "cloudflare_record" "k8s" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "k8s"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_zero_trust_access_application.k8s will be created
  + resource "cloudflare_zero_trust_access_application" "k8s" {
      + account_id                   = (known after apply)
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + domain                       = "k8s.b0xp.io"
      + enable_binding_cookie        = false
      + id                           = (known after apply)
      + name                         = "Access application for k8s.b0xp.io"
      + options_preflight_bypass     = false
      + service_auth_401_redirect    = false
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + skip_interstitial            = false
      + type                         = "self_hosted"
      + zone_id                      = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_zero_trust_access_policy.github_actions_access will be created
  + resource "cloudflare_zero_trust_access_policy" "github_actions_access" {
      + account_id     = "1984a4314b3e75f3bedce97c7a8e0c81"
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "GitHub Actions Access Policy"
      + precedence     = 1

      + include {
          + ip = [
              + "192.30.252.0/22",
              + "185.199.108.0/22",
              + "140.82.112.0/20",
            ]
        }
      + include {
          + github {
              + identity_provider_id = "b9248b7d-c1fa-48ab-8a43-ebffe03fabac"
            }
        }
    }

  # cloudflare_zero_trust_tunnel_cloudflared.k8s_tunnel will be created
  + resource "cloudflare_zero_trust_tunnel_cloudflared" "k8s_tunnel" {
      + account_id   = "1984a4314b3e75f3bedce97c7a8e0c81"
      + cname        = (known after apply)
      + id           = (known after apply)
      + name         = "cloudflare k8s tunnel"
      + secret       = (sensitive value)
      + tunnel_token = (sensitive value)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.k8s_tunnel will be created
  + resource "cloudflare_zero_trust_tunnel_cloudflared_config" "k8s_tunnel" {
      + account_id = "1984a4314b3e75f3bedce97c7a8e0c81"
      + id         = (known after apply)
      + tunnel_id  = (known after apply)

      + config {
          + ingress_rule {
              + hostname = (known after apply)
              + service  = "tcp://kubernetes.default.svc.cluster.local:443"
            }
          + ingress_rule {
              + service = "http_status:404"
            }
        }
    }

  # random_password.tunnel_secret will be created
  + resource "random_password" "tunnel_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2450,"Program":"tfcmt","SHA1":"b514bea7894d3671ee3928edd0f241a0aa328680","Target":"terraform/cloudflare/b0xp.io/k8s","Vars":{},"WorkflowName":"pull_request_target"} -->